Revit 2024 API
BuiltInFailures.AnalyticalModelFailures.CannotSlantAnalyticalWallError Property
 Cannot slant a wall with an Analytical Model. Please disable the Analytical Model first.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotSlantAnalyticalWallError { get; }
Visual Basic
Public Shared ReadOnly Property CannotSlantAnalyticalWallError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotSlantAnalyticalWallError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace